<?php
// Полезные массивы с данными
// научимся хранить данные в массивах
// Для хранения однородных структурированных данных очень хорошо подходят ассоциативный массивы


// 1. Создайте ассоциативный массив животных animals
// данные: мышь - это животное грызун, конь - скачет по полям, хрюшка - кушает желуди
// # ключом элементам массива сделайте - имя животного, а значением - его описание (помните про английские ключи)
$animals = [
    'mouse' => 'это животное грызун',
    'horse' => 'скачет по полям',
    'pig' => 'кушает желуди',
];

// 2. Доработаем этот массив, добавим в него больше данных, теперь для каждого животного у нас будет не только описание, но и другие параметры:
// мышь - это животное грызун, 4 лапы, хвост: лысый
// конь - скачет по полям, 4 ноги, хвост: пушистый
// хрюшка - кушает желуди, 4 ноги, хвост: крючком
// # Для каждого животного создайте ассоциативный массив, с 3-мя полями: описание, количество лап, вид хвоста и замените строки в массиве animals этими массивами
$animals = [
    'mouse' => [
        'description' => 'это животное грызун',
        'legsCount' => 4,
        'tail' => 'лысый',
    ],
    'horse' => [
        'description' => 'скачет по полям',
        'legsCount' => 4,
        'tail' => 'крючком',
    ],
    'pig' => [
        'description' => 'кушает желуди',
        'legsCount' => 4,
        'tail' => 'крючком',
    ],
];

// 3. еще одно уточнение теперь мы знаем, чуть больше о хвостах:
// хвост мыши - лысый, 10 см
// хвост коня - пушистый, 50 см
// хвост хрюшки - крючком, 4 см
// # теперь хвост это тоже массив с двумя полями - тип и размер, создайте такие массивы и поместите внутрь массива animals
$animals = [
    'mouse' => [
        'description' => 'это животное грызун',
        'legsCount' => 4,
        'tail' => [
            'type' => 'лысый',
            'length' => 10
        ],
    ],
    'horse' => [
        'description' => 'скачет по полям',
        'legsCount' => 4,
        'tail' => [
            'type' => 'пушистый',
            'length' => 50
        ],
    ],
    'pig' => [
        'description' => 'кушает желуди',
        'legsCount' => 4,
        'tail' => [
            'type' => 'крючком',
            'length' => 4
        ],
    ],
];

// 4. А теперь опишем, на которой живут эти животный, на ферме есть разные домики для зверьков
// создайте массив с buildings описанием домов, ключом сделайте название дома на английском языке, на ферме следующие дома:
// Жилой дом, этажей 2, цвет - синий
// Стойла, этаже 1, цвет - зеленый
// Будка, этажей 1, цвет - красный
// Элитный-гараж, этажей 5, цвет - черный
$buildings = [
    'house' => [
        'name' => 'Жилой дом',
        'floors' => 2,
        'color' => 'синий'
    ],
    'stalls' => [
        'name' => 'Стойла',
        'floors' => 1,
        'color' => 'зеленый'
    ],
    'dogHouse' => [
        'name' => 'Будка',
        'floors' => 1,
        'color' => 'красный'
    ],
    'luxuryGarage' => [
        'name' => 'Элитный-гараж',
        'floors' => 5,
        'color' => 'черный'
    ],
];


// 5. Теперь нам нужно расселить животных по домам, добавьте каждому животному поле - в котором укажите где оно живет
// мышь живет в жилом доме
// конь живет в стойле
// хрюшка тоже живет в стойле
// # Лучше сделать "ссылку" на дом, для этого в качестве значения укажите ключ из массива buildings
$animals = [
    'mouse' => [
        'description' => 'это животное грызун',
        'legsCount' => 4,
        'tail' => [
            'type' => 'лысый',
            'length' => 10
        ],
        'house' => 'house',
    ],
    'horse' => [
        'description' => 'скачет по полям',
        'legsCount' => 4,
        'tail' => [
            'type' => 'пушистый',
            'length' => 50
        ],
        'house' => 'stalls',
    ],
    'pig' => [
        'description' => 'кушает желуди',
        'legsCount' => 4,
        'tail' => [
            'type' => 'крючком',
            'length' => 4
        ],
        'house' => 'stalls',
    ],
];

// 6. Теперь нам нужно поделиться информацией о всей ферме с кем-то, но на почте нам сказали, что мы можем отправить только одну переменную
// создайте переменную farm с двумя полями animals и buildings и поместите в них значения из соответствующих массивов
// # в качестве значений можно указать значения из других переменных
$farm = [
    'animals' => $animals,
    'buildings' => $buildings
];


// 7. Почта наконец пришла и вы открыли конверт, а там массив farm используя этот массив:
// выведите сколько лап у хрюшки
var_dump($farm['animals']['pig']['legsCount']);
// выведите какого цвета будка
var_dump($farm['buildings']['dogHouse']['color']);
// выведите длину хвоста местных коней
var_dump($farm['animals']['horse']['tail']['length']);
// создайте переменную animal и поместите в нее имя одно из названий животных, на английском (один из ключей массива $animals)
$animal = 'mouse';
// Выведите описание животного, которое помещено в переменной $animal
var_dump($farm['animals'][$animal]['description']);
// Выведите название помещения, в котором живет мышь
// # зная тип дома, в котором живет мышь, можно по этому типу узнать как называется этот дом на ферме
var_dump($farm['buildings'][$farm['animals']['mouse']['house']]['name']);